//=============================================================================
//
// Bullet02.h
// Author : koduna hirohito
//
//=============================================================================
#ifndef _BULLET02_H_			//このマクロ定義がされなかったら
#define _BULLET02_H_			//2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "bulletbase.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CBullet02 : public CBulletBase
{

public:

	CBullet02();//コンストラクタ
	~CBullet02() override;//デストラクタ
	void SetBullet(const Bullet bullet) override;
	void BulletMove() override;//弾の動き
private:
};

#endif